{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertNERModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-CUSTOMER_ID",
    "2": "B-PRODUCT_ID",
    "3": "B-REVENUE",
    "4": "B-DATE",
    "5": "B-QUANTITY",
    "6": "B-LOCATION",
    "7": "B-EMAIL",
    "8": "B-PHONE",
    "9": "B-NAME",
    "10": "B-STATUS",
    "11": "B-CATEGORY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CATEGORY": 11,
    "B-CUSTOMER_ID": 1,
    "B-DATE": 4,
    "B-EMAIL": 7,
    "B-LOCATION": 6,
    "B-NAME": 9,
    "B-PHONE": 8,
    "B-PRODUCT_ID": 2,
    "B-QUANTITY": 5,
    "B-REVENUE": 3,
    "B-STATUS": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.36.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
